{
    "navbar.menu.technologies": "Technologies",
    "navbar.menu.testimonials": "Testimonials",
    "footer.all.right": "All Right Reserved",
    "home.over.title": "About Me",
    "home.over.hi": "Hello",
    "home.title.h1": "I'm Alejandro <br> Arribillaga",
    "home.title.h2": "Javascript Developer",
    "home.career.title": "Software Engineer",
    "home.career.description": "Experienced Software Developer adept in bringing forth expertise in design, programming, installation, testing and maintenance of software systems. Equipped with a diverse and innovative skill-set. Proficient in various platforms, languages, and embedded systems. Experienced with the latest cutting edge development tools and procedures. Able to effectively self-manage during independent projects, as well as collaborate as part of a productive team.",
    "home.download.cv": "Download CV",
    "features.title": "What technologies do I work with?",
    "features.card1.desc": "I have some years of experience in this Google Framework and I currently use it on a daily basis in my current job. Among its features we can say that it is complete, structured, uses Typescript by default, allows bi-directional bindings, you can develop apps with <strong>Ionic</strong>, etc.",
    "features.card1.btn.label": "Read More",
    "features.card2.desc": "I have used Node in some freelance projects. Used both for the creation of Apis and console apps, the biggest advantage I see is that... it's programmed in Javascript. Previously I developed my backends with <strong>.Net Core</strong>.",
    "features.card2.btn.label": "Read More",
    "features.card3.desc": "I have used this Facebook library in some freelance projects and occasionally in my current job. About its features, I can highlight that it uses JS + JSX, Virtual DOM, one-way binding and is very lightweight, you can develop apps with <strong>React Native</strong>, etc.",
    "features.card3.btn.label": "Read More",
    "features.card4.desc": "Both Typescript and Javascript are part of my daily routine. Superset of JavaScript. Class and Module Support. Static Type-checking, etc.",
    "features.card4.btn.label": "Read More",
    "features.card5.desc": "The source of truth. I have implemented and used Redux in both Angular and React. Free to use tool that allows us to store all our state in one place.",
    "features.card5.btn.label": "Read More",
    "features.card6.desc": "Reactive programming is used in all web development today. As their site says: An API for asynchronous programming with observable streams. The Observer pattern done right.",
    "features.card6.btn.label": "Read More",
    "testimonials.title": "Testimonials",
    "technologies.all": "All Technologies",
    "blog.title": "Blog",
    "blog.title.my.name": "Alejandro Arribilllaga",
    "blog.search.placeholder": "Search criteria.",
    "blog.search.btn.label": "Search",
    "testimonials.1.text": "Alejandro is an excellent professional, both technically and in terms of soft skills. I had the opportunity to work with him for a couple of years where I could realize that in addition to having great technical skills, he always has a complete picture of the product or solution that he is working on.",
    "testimonials.2.text": "I worked with Alejandro in several projects related to ERP modules. In addition to being a good person, which I highlight, he is an excellent professional. He is very detailed and always focused on results, great ability to integrate and stand out in work teams. His positive personality always influences the mood of the team, always pushing in critical situations that may arise. It is a highly recommended profile.",
    "testimonials.3.text": "Alejandro is an excellent professional, knowledgeable in many technologies and with good quality criteria. I had the good fortune to work with him in several projects and achieve great challenges. He is a results-oriented person, able to work in a team and lead it. He has an integral vision of products and projects that allows him to understand the needs and requirements of the business, program them and deliver products with great professionalism."
}