{
    "navbar.menu.technologies": "Tecnologías",
    "navbar.menu.testimonials": "Testimonios",
    "footer.all.right": "Todos los Derechos Reservados",
    "home.over.title": "Sobre mi",
    "home.over.hi": "Hola",
    "home.title.h1": "Alejandro <br> Arribillaga",
    "home.title.h2": "Javascript Developer",
    "home.career.title": "Ingeniero en Sistemas",
    "home.career.description": "Desarrollador de software con experiencia en el diseño, la programación, la instalación, las pruebas y el mantenimiento de sistemas de software. Equipado con un conjunto de habilidades diversas e innovadoras. Dominio de varias plataformas, lenguajes y sistemas integrados. Experiencia con las últimas herramientas y procedimientos de desarrollo de vanguardia. Capaz de autogestionar eficazmente proyectos independientes, así como de colaborar como parte de un equipo productivo.",
    "home.download.cv": "Descargar CV",
    "features.title": "¿Con qué tecnologías trabajo?",
    "features.card1.desc": "Tengo algunos años de experiencia en este Framework de Google y actualmente lo uso a diario en mi actual trabajo. Entre sus características podemos decir que es completo, estructurado, utiliza Typescript por defecto, permite bindings bidireccionales, puedes desarrollar apps con <strong>Ionic</strong>, etc.",
    "features.card1.btn.label": "Ver más",
    "features.card2.desc": "He utilizado Node en algunos proyectos freelance. Utilizado tanto para la creación de Apis como de apps de consola, la mayor ventaja que le veo es que... está programado en Javascript. Anteriormente desarrollaba mis backends con <strong>.Net Core</strong>.",
    "features.card2.btn.label": "Ver más",
    "features.card3.desc": "He utilizado esta librería de Facebook en algunos proyectos freelance y ocasionalmente en mi actual trabajo. Sobre sus características, puedo destacar que utiliza JS + JSX, Virtual DOM, one-way binding y es muy ligera, puedes desarrollar apps con <strong>React Native</strong>, etc.",
    "features.card3.btn.label": "Ver más",
    "features.card4.desc": "Tanto Typescript como Javascript forman parte de mi rutina diaria. Superset de Javascript. Soporte de clases y módulos. Comprobación estática de tipos, etc.",
    "features.card4.btn.label": "Ver más",
    "features.card5.desc": "La fuente de la verdad. He implementado y utilizado Redux tanto en Angular como en React. Herramienta de uso gratuito que nos permite almacenar todo nuestro estado en un solo lugar.",
    "features.card5.btn.label": "Ver más",
    "features.card6.desc": "La programación reactiva se utiliza en todo el desarrollo web actual. Como dice su sitio: Una API para la programación asíncrona con flujos observables. El patrón Observador bien hecho.",
    "features.card6.btn.label": "Ver más",
    "testimonials.title": "Testimonios",
    "technologies.all": "Todas las Tecnologías",
    "blog.title": "Blog",
    "blog.title.my.name": "Alejandro Arribilllaga",
    "blog.search.placeholder": "Criterio de búsqueda.",
    "blog.search.btn.label": "Buscar",
    "testimonials.1.text": "Alejandro es un excelente profesional, tanto técnicamente como en términos de habilidades blandas. Tuve la oportunidad de trabajar con él durante un par de años en los que pude darme cuenta de que, además de tener grandes habilidades técnicas, siempre tiene una visión completa del producto o solución en la que está trabajando.",
    "testimonials.2.text": "Trabajé con Alejandro en varios proyectos relacionados a módulos de ERP. Además de buena persona, que rescato principalente, es un excelente profesional. Es muy detallista y enfocado siempre en los resultados, gran capacidad de integrarse y destacarse en equipos de trabajo. Su personalidad positiva siempre influye en el envión anímico del equipo, empujando siempre en las situaciones críticas que puedan presentarse. Es un perfil muy recomendable.",
    "testimonials.3.text": "Alejandro es un excelente profesional, con conocimiento en muchas tecnologías y con buen criterio de calidad. Tuve la suerte de trabajar junto a él en varios proyectos y lograr grandes desafíos. Es una persona orientada a resultados, capaz de trabajar en equipo y liderarlo. Tiene una visión integral de los productos y proyectos que le permiten comprender las necesidades y requerimientos del negocio, programarlas y realizar deliverys de productos con mucho profesionalismo.",
    "blog.by": "por",
    "blog.1.title": "Server Side Rendering (SSR) - Primeros Pasos (I)",
    "blog.1.subtitle": "Angular Universal",
    "blog.1.cheatsheet.title": "Recordatorios",
    "blog.1.cheatsheet.headers.1.text": "Comando",
    "blog.1.cheatsheet.headers.2.text": "Descripción",    
    "blog.1.cheatsheet.1.col.2.text": "Iniciar proyecto de Angular",
    "blog.1.cheatsheet.2.col.2.text": "Servir la app de Angular",
    "blog.1.cheatsheet.3.col.2.text": "Muestra lo que verá el motor al visitar nuestra página",
    "blog.1.cheatsheet.4.col.2.text": "Instalación de packete Angular Universal",
    "blog.1.cheatsheet.5.col.2.text": "Build en SSR",
    "blog.1.cheatsheet.6.col.2.text": "Servir la app de Angular en SSR",
    "blog.2.title": "Server Side Rendering (SSR) - Mejorando el Rendimiento (II)",
    "blog.2.subtitle": "Angular Universal",
    "blog.3.title": "Server Side Rendering (SSR) - Lazy Loading (III)",
    "blog.3.subtitle": "Angular Universal",
    "blog.3.cheatsheet.title": "Recordatorios",
    "blog.3.cheatsheet.headers.1.text": "Comando",
    "blog.3.cheatsheet.headers.2.text": "Descripción",    
    "blog.3.cheatsheet.1.col.2.text": "Crea un modulo por pagina más otro para routing",
    "blog.3.cheatsheet.2.col.2.text": "Crea un nuevo componente o página",
    "blog.3.cheatsheet.3.col.2.text": "Definicion de Ruta sin Lazy Loading",
    "blog.3.cheatsheet.4.col.2.text": "Reemplaza en Lazy Loading al 'componente'",
    "blog.4.title": "Server Side Rendering (SSR) - Prerendering and SS and Browser Detection (IV)",
    "blog.4.subtitle": "Angular Universal",
    "blog.4.cheatsheet.title": "Recordatorios",
    "blog.4.cheatsheet.headers.1.text": "Comando",
    "blog.4.cheatsheet.headers.2.text": "Descripción",
    "blog.4.cheatsheet.1.col.2.text": "Script de ejecución del Prerendering en SSR",
    "blog.4.cheatsheet.2.col.2.text": "Inyección de Platform",
    "blog.4.cheatsheet.3.col.2.text": "Determina si el platform es el Servidor Express",
    "blog.4.cheatsheet.4.col.2.text": "Determina si el platform es el Browser (Cliente)",
    "blog.5.title": "Server Side Rendering (SSR) - Trabajando con SEO tags (V)",
    "blog.5.subtitle": "Angular Universal",
    "blog.5.cheatsheet.title": "Recordatorios",
    "blog.5.cheatsheet.headers.1.text": "Comando",
    "blog.5.cheatsheet.headers.2.text": "Descripción"    
}